<a href="https://colab.research.google.com/github/profliuhao/CSIT355/blob/main/CSIT_355_Module_5_SQL_aggregation_exercise_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Lab 3: SQL Aggregation Queries - Part 2

### [name]
### [student ID]

## Instruction
You need to finish all questions of In-class exercises. Name your ipynb file as StudentName_lab3.ipynb and download it as .py file. And then submit it on Canvas.

PLEASE ENSURE THAT THE SCRIPT CAN CORRECTLY EXECUTE!!!

In [1]:
#Let's connect to a database **lab3.db** using:
%load_ext sql
#%reload_ext sql
%sql sqlite:///lab3.db

In [2]:
%%sql
-- Create the "Sailors" table
drop table if exists Sailors;
drop table if exists Reserves;
drop table if exists Boats;
CREATE TABLE Sailors (
    sid int PRIMARY KEY,
    sname VARCHAR,
    rating int,
    age real
);

-- Create the "Reserves" table
CREATE TABLE Reserves (
    sid int,
    bid int,
    day DATE,
    PRIMARY KEY (sid, bid),
    FOREIGN KEY (sid) REFERENCES Sailors(sid),
    FOREIGN KEY (bid) REFERENCES Boats(bid)
);

-- Create the "Boats" table
CREATE TABLE Boats (
    bid int PRIMARY KEY,
    name VARCHAR,
    color VARCHAR
);

-- Insert rows into the "Sailors" table
delete from Sailors;
INSERT INTO Sailors (sid, sname, rating, age) VALUES
    (22, 'Dustin', 7, 45),
    (29, 'Brutus', 1, 33),
    (31, 'Lubber', 8, 55.5),
    (32, 'Andy', 8, 25.5),
    (58, 'Rusty', 10, 35),
    (64, 'Horatio', 7, 35),
    (71, 'Zorba', 10, 16),
    (74, 'Horatio', 9, 35),
    (85, 'Art', 3, 25.5),
    (95, 'Bob', 3, 63.5);

-- Insert rows into the "Boats" table
delete from Boats;
INSERT INTO Boats (bid, name, color) VALUES
    (101, 'Interlake', 'blue'),
    (102, 'Interlake', 'red'),
    (103, 'Clipper', 'green'),
    (104, 'Marine', 'red');

-- Insert rows into the "Reserves" table
delete from Reserves;
INSERT INTO Reserves (sid, bid, day) VALUES
    (22, 101, '10/10/98'),
    (22, 102, '10/11/98'),
    (22, 103, '10/8/98'),
    (22, 104, '10/7/98'),
    (31, 102, '11/10/98'),
    (31, 103, '10/6/98'),
    (31, 104, '11/12/98'),
    (64, 101, '9/5/98'),
    (64, 102, '9/8/98'),
    (74, 103, '9/8/98');

 * sqlite:///lab3.db
Done.
Done.
Done.
Done.
Done.
Done.
0 rows affected.
10 rows affected.
0 rows affected.
4 rows affected.
0 rows affected.
10 rows affected.

[]

Find rating that has lowest average sailor age

In [3]:
%%sql
SELECT S.rating
FROM Sailors S
WHERE S.age = (SELECT MIN (AVG(S2.age))
        FROM Sailors S2)

 * sqlite:///lab3.db
(sqlite3.OperationalError) misuse of aggregate function AVG()
[SQL: SELECT S.rating
FROM Sailors S
WHERE S.age = (SELECT MIN (AVG(S2.age))
        FROM Sailors S2)]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [4]:
%%sql
SELECT S2.rating, AVG(S2.age)
FROM Sailors S2
Group by S2.rating

 * sqlite:///lab3.db
Done.

[(1, 33.0), (3, 44.5), (7, 40.0), (8, 40.5), (9, 35.0), (10, 25.5)]

In [5]:
%%sql
SELECT MIN (AVG(S2.age))
FROM Sailors S2
Group by S2.rating

 * sqlite:///lab3.db
(sqlite3.OperationalError) misuse of aggregate function AVG()
[SQL: SELECT MIN (AVG(S2.age))
FROM Sailors S2
Group by S2.rating]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [6]:
%%sql

select Temp.rating, MIN(Temp.average)

from (SELECT S.rating, AVG(S.age) AS average
        FROM Sailors S
        GROUP BY S.rating) Temp

 * sqlite:///lab3.db
Done.

[(10, 25.5)]

In [7]:
%%sql
SELECT Temp.rating, Temp.average as average
FROM (
  SELECT S.rating, AVG(S.age) AS average
        FROM Sailors S
        GROUP BY S.rating
        ) Temp
WHERE Temp.average = (
  SELECT MIN(Temp2.average)
    FROM (
      SELECT S.rating, AVG(S.age) AS average
      FROM Sailors S
      GROUP BY S.rating
      ) Temp2
  );

 * sqlite:///lab3.db
Done.

[(10, 25.5)]

In [8]:
%%sql
SELECT Temp.rating, Temp.average AS average
FROM (
    SELECT S.rating, AVG(S.age) AS average
    FROM Sailors S
    GROUP BY S.rating
) Temp
WHERE Temp.average = (
    SELECT MIN(Temp.average)
    FROM Temp
);

 * sqlite:///lab3.db
(sqlite3.OperationalError) no such table: Temp
[SQL: SELECT Temp.rating, Temp.average AS average
FROM (
    SELECT S.rating, AVG(S.age) AS average
    FROM Sailors S
    GROUP BY S.rating
) Temp
WHERE Temp.average = (
    SELECT MIN(Temp.average)
    FROM Temp
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

Find the average age of students taking some course with 3 credits

In [9]:
%%sql
DROP TABLE IF EXISTS Students;

CREATE TABLE Students (
  sid CHAR(20),
  name CHAR(20),
  login CHAR(10),
  age INT,
  gpa FLOAT
);

-- insert students values

INSERT INTO Students (sid, name, login, age, gpa) VALUES ('S001', 'John Smith', 'johns', 24, 3.5);
INSERT INTO Students (sid, name, login, age, gpa) VALUES ('S002', 'Emma Johnson', 'emma_j', 21, 3.7);
INSERT INTO Students (sid, name, login, age, gpa) VALUES ('S003', 'Michael Brown', 'mike_b', 22, 3.2);
INSERT INTO Students (sid, name, login, age, gpa) VALUES ('S004', 'Sophia Davis', 'soph_d', 29, 3.9);
INSERT INTO Students (sid, name, login, age, gpa) VALUES ('S005', 'William Wilson', 'will_w', 25, 3.6);
INSERT INTO Students (sid, name, login, age, gpa) VALUES ('S006', 'Olivia Martinez', 'olivia_m', 19, 3.8);
INSERT INTO Students (sid, name, login, age, gpa) VALUES ('S007', 'James Taylor', 'james_t', 21, 3.4);
INSERT INTO Students (sid, name, login, age, gpa) VALUES ('S008', 'Ava Anderson', 'ava_a', 20, 3.9);
INSERT INTO Students (sid, name, login, age, gpa) VALUES ('S009', 'Alexander Thomas', 'alex_t', 26, 3.5);
INSERT INTO Students (sid, name, login, age, gpa) VALUES ('S010', 'Mia Hernandez', 'mia_h', 23, 3.7);


-- Create the Enrolled table
DROP TABLE IF EXISTS Enrolled;

CREATE TABLE Enrolled (
  sid CHAR(20),
  cid CHAR(20),
  grade CHAR(2)
);

-- Insert fake data into the Enrolled table
INSERT INTO Enrolled (sid, cid, grade) VALUES ('S001', 'C001', 'A');
INSERT INTO Enrolled (sid, cid, grade) VALUES ('S002', 'C002', 'B+');
INSERT INTO Enrolled (sid, cid, grade) VALUES ('S003', 'C003', 'A-');
INSERT INTO Enrolled (sid, cid, grade) VALUES ('S004', 'C004', 'B');
INSERT INTO Enrolled (sid, cid, grade) VALUES ('S001', 'C005', 'C');
INSERT INTO Enrolled (sid, cid, grade) VALUES ('S002', 'C006', 'B+');
INSERT INTO Enrolled (sid, cid, grade) VALUES ('S002', 'C002', 'A');
INSERT INTO Enrolled (sid, cid, grade) VALUES ('S003', 'C003', 'B-');
INSERT INTO Enrolled (sid, cid, grade) VALUES ('S004', 'C002', 'A');
INSERT INTO Enrolled (sid, cid, grade) VALUES ('S005', 'C001', 'C+');
INSERT INTO Enrolled (sid, cid, grade) VALUES ('S001', 'C009', 'C');
INSERT INTO Enrolled (sid, cid, grade) VALUES ('S002', 'C001', 'B+');
INSERT INTO Enrolled (sid, cid, grade) VALUES ('S002', 'C007', 'A');
INSERT INTO Enrolled (sid, cid, grade) VALUES ('S003', 'C001', 'B-');
INSERT INTO Enrolled (sid, cid, grade) VALUES ('S004', 'C005', 'A');
INSERT INTO Enrolled (sid, cid, grade) VALUES ('S005', 'C003', 'C+');



-- Create the Courses table
DROP TABLE IF EXISTS Courses;

CREATE TABLE Courses (
  cid CHAR(20),
  cname CHAR(20),
  credits INT
);

-- Insert fake data into the Courses table
INSERT INTO Courses (cid, cname, credits) VALUES ('C001', 'Introduction to Computer Science', 3);
INSERT INTO Courses (cid, cname, credits) VALUES ('C002', 'Data Structures and Algorithms', 4);
INSERT INTO Courses (cid, cname, credits) VALUES ('C003', 'Database Management Systems', 3);
INSERT INTO Courses (cid, cname, credits) VALUES ('C004', 'Software Engineering', 4);
INSERT INTO Courses (cid, cname, credits) VALUES ('C005', 'Operating Systems', 3);
INSERT INTO Courses (cid, cname, credits) VALUES ('C006', 'Computer Networks', 3);
INSERT INTO Courses (cid, cname, credits) VALUES ('C007', 'Artificial Intelligence', 4);
INSERT INTO Courses (cid, cname, credits) VALUES ('C008', 'Web Development', 3);
INSERT INTO Courses (cid, cname, credits) VALUES ('C009', 'Machine Learning', 4);
INSERT INTO Courses (cid, cname, credits) VALUES ('C010', 'Cybersecurity', 3);

 * sqlite:///lab3.db
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [10]:
%%sql
SELECT AVG(S.age)
FROM Students S, Enrolled E, Courses C
WHERE S.sid = E.sid AND E.cid=C.cid AND C.credits=3

 * sqlite:///lab3.db
Done.

[(23.5,)]

In [11]:
%%sql
SELECT S.name
FROM Students S, Enrolled E, Courses C
WHERE S.sid = E.sid AND E.cid=C.cid AND C.credits=3

 * sqlite:///lab3.db
Done.

[('John Smith',),
 ('Emma Johnson',),
 ('Michael Brown',),
 ('William Wilson',),
 ('Michael Brown',),
 ('Michael Brown',),
 ('William Wilson',),
 ('John Smith',),
 ('Sophia Davis',),
 ('Emma Johnson',)]

In [12]:
%%sql
SELECT AVG(S1.age)
FROM Students S1
WHERE
S1.sid IN (SELECT S.sid
            FROM Students S, Enrolled E, Courses C
            WHERE S.sid=E.sid AND E.cid=C.cid AND
            C.credits=3)

 * sqlite:///lab3.db
Done.

[(24.2,)]

In [13]:
%%sql
SELECT S1.name
FROM Students S1
WHERE
S1.sid IN (SELECT S.sid
            FROM Students S, Enrolled E, Courses C
            WHERE S.sid=E.sid AND E.cid=C.cid AND
            C.credits=3)

 * sqlite:///lab3.db
Done.

[('John Smith',),
 ('Emma Johnson',),
 ('Michael Brown',),
 ('Sophia Davis',),
 ('William Wilson',)]

Find the average age over enrolled students that are 25 or younger for
each course with at least 2 enrolled students (of any age)

In [14]:
%%sql

SELECT C.cname, AVG(S.age)
FROM Students S, Enrolled E, Courses C
WHERE S.sid = E.sid AND E.cid = C.cid AND S.age <= 25
GROUP BY C.cid, C.cname
HAVING 2 < (
  SELECT COUNT(*)
  FROM Enrolled E1
  WHERE E1.cid = C.cid
  )

 * sqlite:///lab3.db
Done.

[('Introduction to Computer Science', 23.0),
 ('Data Structures and Algorithms', 21.0),
 ('Database Management Systems', 23.0)]

# Exercise 1
Find the average age of enrolled students for each course with at least 10 enrolled students.
List the course name(s) as well.

In [15]:
%%sql

 * sqlite:///lab3.db

# Exercise 2
Find the average age of enrolled students for each course satisfying following two conditions: (1)
course has at least 2 enrolled students and (2) at least one enrolled student has age higher than 20

In [16]:
%%sql

 * sqlite:///lab3.db